In [1]:
import pandas as pd
import numpy as np

In [2]:
 df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                    'key2' : ['one', 'two', 'one', 'two', 'one'], 
                    'data1' : np.random.randn(5),
                    'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.242919 -1.002997
1    a  two  0.516652 -1.820937
2    b  one -0.228684  0.839467
3    b  two  2.018467 -0.574795
4    a  one -1.016564 -0.320747

In [3]:
len(df.groupby('key1'))

2

In [5]:
for name,group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.242919 -1.002997
1    a  two  0.516652 -1.820937
4    a  one -1.016564 -0.320747
b
  key1 key2     data1     data2
2    b  one -0.228684  0.839467
3    b  two  2.018467 -0.574795

In [6]:
group=df.groupby('key1')

In [7]:
group.mean()

         data1     data2
key1
a    -0.085664 -1.048227
b     0.894891  0.132336

### Multiple keys

In [8]:
x=df.groupby(['key1','key2']).mean()
x

              data1     data2
key1 key2
a    one  -0.386823 -0.661872
     two   0.516652 -1.820937
b    one  -0.228684  0.839467
     two   2.018467 -0.574795

In [9]:
x.unstack()

         data1               data2
key2       one       two       one       two
key1
a    -0.386823  0.516652 -0.661872 -1.820937
b    -0.228684  2.018467  0.839467 -0.574795

In [10]:
list(df.groupby("key1"))[0][1]

  key1 key2     data1     data2
0    a  one  0.242919 -1.002997
1    a  two  0.516652 -1.820937
4    a  one -1.016564 -0.320747

In [11]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people

               a         b         c         d         e
Joe     1.277682 -0.165136  1.512252  0.587672  0.998931
Steve   0.262474 -0.061874 -0.059211  0.660331 -0.183611
Wes    -0.424419 -0.734628  0.573075 -1.441967  1.015612
Jim     0.842042  0.385828  0.426040  0.721760  0.114937
Travis  0.346529 -0.454935 -0.473904 -1.057275 -1.615779

In [12]:
people.loc['Wes','b']=np.NaN

In [13]:
people.loc['Wes','c']=np.NaN

In [14]:
mapping={'a':'red','b':"red",'c':"blue",'d':"blue","e":"red","f":"orange"}

In [15]:
people

               a         b         c         d         e
Joe     1.277682 -0.165136  1.512252  0.587672  0.998931
Steve   0.262474 -0.061874 -0.059211  0.660331 -0.183611
Wes    -0.424419       NaN       NaN -1.441967  1.015612
Jim     0.842042  0.385828  0.426040  0.721760  0.114937
Travis  0.346529 -0.454935 -0.473904 -1.057275 -1.615779

In [16]:
y=people.groupby(mapping,axis=1)

In [17]:
y.sum()

            blue       red
Joe     2.099925  2.111477
Steve   0.601121  0.016988
Wes    -1.441967  0.591193
Jim     1.147799  1.342807
Travis -1.531179 -1.724184

In [18]:
z=people.groupby(len)

In [19]:
for name,group in z:
    print(group)

            a         b         c         d         e
Joe  1.277682 -0.165136  1.512252  0.587672  0.998931
Wes -0.424419       NaN       NaN -1.441967  1.015612
Jim  0.842042  0.385828  0.426040  0.721760  0.114937
              a         b         c         d         e
Steve  0.262474 -0.061874 -0.059211  0.660331 -0.183611
               a         b         c         d         e
Travis  0.346529 -0.454935 -0.473904 -1.057275 -1.615779

In [20]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'], [1, 3, 5, 1, 3]], names=['cty', 'tenor'])

In [21]:
 hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
 hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -1.578097  1.482984 -0.781994 -0.882389  0.847569
1      0.929034  0.283532 -0.658752 -1.156543 -0.172957
2     -0.852329 -1.704775  0.216606 -0.842731 -0.002465
3     -0.367211  0.664652 -1.912160 -0.909803 -1.130868

In [22]:
 k=hier_df.groupby(level='cty',axis=1)

In [23]:
for i in k:
    print(i)

('JP', cty          JP
tenor         1         3
0     -0.882389  0.847569
1     -1.156543 -0.172957
2     -0.842731 -0.002465
3     -0.909803 -1.130868)
('US', cty          US
tenor         1         3         5
0     -1.578097  1.482984 -0.781994
1      0.929034  0.283532 -0.658752
2     -0.852329 -1.704775  0.216606
3     -0.367211  0.664652 -1.912160)

In [24]:
x.agg('describe')

          data1     data2
count  4.000000  4.000000
mean   0.479903 -0.554534
std    1.098763  1.089181
min   -0.386823 -1.820937
25%   -0.268219 -0.951638
50%    0.143984 -0.618333
75%    0.892106 -0.221230
max    2.018467  0.839467

In [25]:
df

  key1 key2     data1     data2
0    a  one  0.242919 -1.002997
1    a  two  0.516652 -1.820937
2    b  one -0.228684  0.839467
3    b  two  2.018467 -0.574795
4    a  one -1.016564 -0.320747

In [26]:
df

  key1 key2     data1     data2
0    a  one  0.242919 -1.002997
1    a  two  0.516652 -1.820937
2    b  one -0.228684  0.839467
3    b  two  2.018467 -0.574795
4    a  one -1.016564 -0.320747

In [28]:
f=df.groupby(["key1",'key2']).agg(['mean','std'])
f

              data1               data2
               mean       std      mean       std
key1 key2
a    one  -0.386823  0.890589 -0.661872  0.482424
     two   0.516652       NaN -1.820937       NaN
b    one  -0.228684       NaN  0.839467       NaN
     two   2.018467       NaN -0.574795       NaN

In [60]:
d=df.groupby(["key1",'key2']).agg([("average",'mean'),('standard deviation','std')])

In [61]:
d['data1']

            average  standard deviation
key1 key2
a    one   0.296748             1.37587
     two  -0.299114                 NaN
b    one   2.996056                 NaN
     two   0.133203                 NaN